cask_args appdir: "/Applications"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "d12frosted/emacs-plus"

brew "youtube-dl"
brew "d12frosted/emacs-plus/emacs-plus@28", args: ['without-imagemagick']
cask "homebrew/cask/programmer-dvorak"
cask "alfred"
cask "anki"
cask "veracrypt"
cask "macfuse"
cask "telegram"

cask "transmission"

cask "setapp"

brew "blueutil"
brew "libvterm"
brew "node"
cask "intellij-idea"
cask "syncthing"
cask "toggl-track"
cask "homebrew/cask-versions/docker-edge"
cask "adobe-creative-cloud"
cask "iina"

cask "iterm2"
